<template>
    <div class="mb-5 border p-4">
        <div class="">
            Отправка изображений на сервер начинается с заполнения формы, где должно быть указано: 
            <span class="badge text-bg-info">method="post" enctype="multipart/form-data"</span><br>
            Метод POST означает что данные будут отправлятся в <strong>теле запроса</strong>, так как они могуть большого размера.<br>
            enctype означает что передаваемые данные будут  BLOB типа, бинарный массив. <br>
            На серверной стороне файл изображения попадает, в определённую для этих целей, директорию а имя файла отдельно заносится в Базу Данных.<br>
            Если нам надо отдельно загрузить этот файл, то мы обращаемся к серверу, указывая название файла, а загружаться он будет с той папки, куда мы отправили его при загрузке.

        </div>
    </div>
</template>

<script>

export default {
    name: "PhotoComponent",
    data() {return {};},
}
</script>

<style scoped>

</style>