<template>
    <div class="mb-5 border p-4">
        <p>
            Хранилища на клиентской стороне можно посмотреть на скриншоте.
        </p>
        <img src="../assets/stores.png" alt="stores">
        <p>

        </p>
        <p>
            В своей работе использовал LocalStorage в основном для хранения максимум до 5-ти значений ключ-значение. Во многих случаях просто для хранения выбранного пункта меню, при перезагрузки страницы.
        </p>
        <p>
            Максимально использовал <strong>VUEX</strong> в последних проектах со сложным функционалом, для асинхронной загрузки данных с серверов.
        </p>
        <p>
            К сожалению, IndexedDB не пришлось поюзать, так как не было задач на эту тему.
        </p>
    </div>
</template>

<script>

export default {
    name: "TypesStoreComponent",
    data() {return {};},
}
</script>

<style>
</style>